{
    "name": "Alhaitham",
    "element": "DENDRO",
    "rarity": 5,
    "weapon_type": "SWORD",
    "roles": [
        "SPREAD DPS ✩"
    ],
    "weapons": [
        "1. Light of Foliar Incision (5☆)*\n2. Primordial Jade Cutter (5☆)\n3. Mistsplitter Reforged (5☆)\n~= Haran Geppaku Futsu (5☆)\n4. Freedom-Sworn (5☆)\n5. Toukabou Shigure (4☆)*\n6. The Black Sword (4☆)\n7. Summit Shaper (5☆)\n~= Iron Sting (4☆)\n~= Blackcliff Longsword (4☆)\n~= Harbinger of Dawn (3☆)*\n8. Xiphos' Moonlight (4☆)*\n~= Festering Desire (4☆)\n9. Skyward Blade (5☆)\n10. Sapwood Blade (4☆)"
    ],
    "artifacts": [
        "1. Gilded Dreams (4)*\n2. Deepwood Memories (2) / Emblem of Severed Fate (2) / +80 EM set (2)\n [Choose Two]* \n3. Deepwood Memories (4)"
    ],
    "main_stats": [
        "Sands - Elemental Mastery / ATK%\nGoblet - Dendro DMG\nCirclet - Crit Rate / DMG"
    ],
    "sub_stats": [
        "1. Energy Recharge* (Until Requirement)\n2. Crit Rate / DMG\n3. Elemental Mastery**\n4. ATK%\n5. Flat ATK\n\n* Certain quicken teams can run little to no Energy Recharge and simply burst every other rotation without a dps loss\n** If you're running under 200 Elemental Mastery this substat has priority over Crit"
    ],
    "talents": [
        "1. Skill\n2. Normal Attack\n~= Burst\n\n"
    ],
    "tips": [
        "Basic Rotations:\n\nBurst up = Q > E > N2D + 2N3D + N1C + 2N2C\n\nBurst down = E > N1C + 5N2C + N1\n\nThe linked guide goes over his optimal rotations in more detail\n"
    ],
    "notes": "SPREAD DPS\nThis playstyle makes the best use of Alhaitham's kit. Since both Spread reactions, his skill (the primary source of his damage) and burst scale heavily off Elemental Mastery. Further enhanced by his high rate of on-field Dendro application. All of this combined with his flexible teams and rotations makes him one of the best Spread DPS currently released. Lastly bear in mind that a large part of his damage comes from Dendro reactions (especially in Quicken/Quickbloom teams), which scale heavily off his levels, so you should prioritise levelling him to 90/90.\n\nRegarding Weapon Choices:\nLight of Foliar Incision: This weapon prefers EM sands even in situations with fewer or no Spread procs such as in Bloom/Burgeon/Hyperbloom teams.\nToukabou Shigure: This ranking assumes single-target situations, in AoE situations it starts falling behind weapons such as Iron Sting and Blackcliff Longsword.\nHarbinger of Dawn: If you can maintain near perfect uptime on its passive this weapon will perform similarly to weapons like Haran Geppaku Futsu.\nXiphos' Moonlight / Festering Desire: These weapons can perform similarly to The Black Sword in teams where you have higher Energy Recharge requirements or want to burst every rotation.\n\nRegarding Artifact Sets:\nGilded Dreams (4): This ranking assumes that you already have another Deepwood Memories holder on the team, if not then Deepwood Memories becomes his best set.\nDeepwood Memories (2) / Emblem of Severed Fate (2) / +80 EM set (2): These split set options can actually perform similarly to Gilded Dreams (4) or even surpass it in situations where you have higher Energy Recharge requirements or want to burst every rotation. Or even if they just have better substat rolls on them.\n\nRegarding Mainstat Priorities: Usually in Quicken/Quickbloom teams Alhaitham leans towards Elemental Mastery sands (roughly 5% or so difference usually). But in Bloom/Burgeon/Hyperbloom teams with, fewer to no Spread reactions, he skews more towards ATK% sands (unless you're using Light of Foliar Incision). Or even Energy Recharge sands if you're trying to burst every rotation for increased Dendro seed generation in those teams.\n\n"
}