{
    "name": "Childe",
    "element": "HYDRO",
    "rarity": 5,
    "weapon_type": "BOW",
    "roles": [
        "DPS ✩"
    ],
    "weapons": [
        "1. Polar Star (5✩)* \n2. Thundering Pulse (5✩)*\n~= Hunter's Path (5✩)\n~= Aqua Simulacra (5✩)\n3. Skyward Harp (5✩)\n4. Amos' Bow (5✩)\n5. The Viridescent Hunt (4✩)*\n6. Blackcliff Warbow (4✩)*\n7. Mouun's Moon (4✩) \n~= Prototype Crescent (4✩)*\n8. Rust (4✩) \n~= King's Squire (4✩)\n~= Hamayumi (4✩) \n~= The Stringless (4✩)*\n9. Slingshot (3✩)"
    ],
    "artifacts": [
        "1. Heart of Depth (4)\n2. Heart of Depth (2) +18% ATK set (2)* \n3. Noblesse Oblige (2) / Heart of Depth (2) / +18% ATK set (2) [Choose Two]\n4. Shimenawa's Reminiscence (4)*"
    ],
    "main_stats": [
        "Sands - ATK%\nGoblet - Hydro DMG\nCirclet - Crit Rate / DMG"
    ],
    "sub_stats": [
        "1. Crit Rate / DMG\n2. ATK%\n3. Elemental Mastery\n4. Energy Recharge\n5. Flat ATK"
    ],
    "talents": [
        "1. Skill\n2. Burst\n3. Normal Attack"
    ],
    "tips": [
        "Optimal skill duration for [C0]: 7s, 9s or 12s.\nOptimal skill duration for [C1]: 9s, 11s or 14s.\n\nMelee Burst: Only to be used in situations where you need only 1 rotation to clear as the ER requirement to maintain burst uptime is quite high (170-190%), you'll always want to start your rotations with Ranged Burst since it refunds energy to maintain your rotation well.\n\nSkill Combo:\n- 2 NA + 1 CA (Optimal)\n- 3 NA + 1 CA (Recommended)\n- 5 NA + 1 CA (Recommended combo if using Rust or Thundering Pulse)\n\n*NA = Normal Attack, CA = Charged Attack\n\nThe Optimal combo provides more damage but consumes more stamina. Recommended combo provides slightly less damage but is stamina neutral and what most weapons should use. \n"
    ],
    "notes": "DPS\nThe Weapon Rankings here are under the assumption that Childe is used with Bennett and Vaporizes his Burst, aswell as using the optimal attack combos listed in the Ability Tips section.\n\nRegarding Weapon Choices:\nPolar Star: Has varied performance depending on how many passive stacks you get. Getting 2-3 stacks at the start of your rotation can perform better than Thundering Pulse while getting no stacks can perform worse than Skyward Harp.  This only applies if you are Vaporizing Childe Burst together with Bennett. In teams without Bennett, Polar Star will always perform better than the other options. 3 stacks can be achieved by doing Skill + 1 Normal + 1 Charged Attack before setting up your Vaporize Burst. If your Skill is still on cooldown, a fully Charged Aimed shot against a riptide affected target, OR a Ranged Normal + quick Aimed shot gives 2 stacks (which can be followed by Skill for the 3rd stack).\nThundering Pulse: Slightly better than Skyward Harp depending on rotations - the more time you spend doing Normal Attacks, the more it pulls ahead over Skyward Harp, but it's not recommended to extend your Childe's melee rotation for this.\nThe Viridescent Hunt: Offers a valuable passive that helps a lot in grouping enemies, which can offer a ton of damage from Riptide.\nBlackcliff Warbow: Due to inconsistency of gaining stacks, falls off compared to other weapons at higher refinements.\nPrototype Crescent: Requires you to trigger its passive by hitting the enemy's weak points, falls off if compared with other options without the passive triggered.\nThe Stringless: Main DPS Childe should only use this weapon in teams where you are Vaporizing your Burst, as the Elemental Mastery substat loses a lot of value in other teams. If Childe is being used as a Nuke Support only for his Vaporized Burst damage, R5 Stringless will rank just below Thundering Pulse. Note that the Stringless Elemental Skill passive does not affect Childe's melee stance auto attacks.\n\nRegarding Artifact Sets:\nHeart of Depth (2) +18% ATK set (2): This set is only about 1-2 substats behind Heart of Depth (4), you can opt out for this set instead if you already have decent pieces.\nShimenawa's Reminiscence (4): Due to this set requiring Childe to have around 150% Energy Recharge to reliably burst every rotation, it falls behind the other options. However, it outperforms Heart of Depth (4) if used in a single rotation setting (ignoring ER)."
}