{
    "name": "Faruzan",
    "element": "ANEMO",
    "rarity": 4,
    "weapon_type": "BOW",
    "roles": [
        "SUPPORT\n✩"
    ],
    "weapons": [
        "1. Favonius Warbow (4✩)\n2. Elegy for the End (5✩)*\n3. End of the Line (4✩)\n4. Fading Twilight (4✩)\n~= Sacrificial Bow (4✩)*"
    ],
    "artifacts": [
        "1. Viridescent Venerer (4)\n2. Noblesse Oblige (4)*\n3. Emblem of Severed Fate (4)*\n4. Tenacity of the Millelith (4)*\n5. Emblem of Severed Fate (2) / +20% ER set (2)"
    ],
    "main_stats": [
        "Sands - Energy Recharge\nGoblet - Anemo DMG\nCirclet - Crit Rate / DMG"
    ],
    "sub_stats": [
        "1. Energy Recharge\n2. Crit Rate*\n3. Crit DMG\n4. ATK%\n5. Flat ATK\n\n* Only assumes higher priority than Crit DMG when using Favonius Warbow"
    ],
    "talents": [
        "1. Burst\n2. Skill\n3. Normal Attack"
    ],
    "tips": [
        "Regarding Optimal Rotations\n\nFor funneling particles to Faruzan:\nSkill --> Charged Shot --> Burst\n\nFor funneling particles to other units:\nSkill --> Burst --> Charged Shot\n\nAt C6 bear in mind the Charged shot portion of the rotation no longer becomes necessary since your burst will start activating the Pressurized Collapses instead.\n"
    ],
    "notes": "SUPPORT\nAs the premier Anemo support unit for Anemo dps based teams, Faruzan combines both high Anemo damage buffing with Anemo resistance shredding to become a cornerstone of any team that wants to focus on Anemo damage. Though building her means primarly focusing on dealing with her high energy requirements.\n\nRegarding Weapon Choices:\nElegy for the End: Usually only a better option at higher constellation levels such as [C6] where her energy needs can be met without Favonius passive particles.\nSacrificial Bow: It's worth mentioning that the extra Pressurized Collapse from a second E wont give you any extra particles if it's within her 5.5 second particle generation cooldown.\n\nRegarding Artifact Sets:\nNoblesse Oblige (4): This is her best option in teams that either won't benefit significantly from Viridescent Venerer (4) shred, or teams that already have another unit holding the aforementioned set.\nTenacity of the Millelith (4): This has similar usage cases to Noblesse Oblige (4), except in that it requires Faruzan C6 for improved uptime through extra Pressurized Collapse activations.\nEmblem of Severed Fate (4): This set will give Faruzan her best personal damage output, assuming the team is already running Viridescent Venerer (4). Also if you're willing to invest more time farming substats it can potentially give you more Energy Recharge than running The Exile (2)."
}