{
    "name": "Raiden Shogun",
    "element": "ELECTRO",
    "rarity": 5,
    "weapon_type": "POLEARM",
    "roles": [
        "HYPERBLOOM ",
        "DPS ✩"
    ],
    "weapons": [
        "1. Dragon's Bane (4✩)\n2. Moonpiercer (4✩)\n3. Kitain Cross Spear (4✩)",
        "1. Engulfing Lightning (5✩)\n2. Staff of Homa (5✩) \n3. Primordial Jade Winged-Spear (5✩)\n~= Staff of the Scarlet Sands (5✩)*\n4. Calamity Queller (5✩)\n5. \"The Catch\" (4✩) [R5] \n~= Skyward Spine (5✩)*\n6. Vortex Vanquisher (5✩)\n7. Deathmatch (4✩)\n8. Wavebreaker's Fin (4✩)*\n9. Lithic Spear (4✩)*\n10. Favonius Lance (4✩)\n11. Prototype Starglitter (4✩)\n12. Blackcliff Pole (4✩)\n13. White Tassel (3✩)"
    ],
    "artifacts": [
        "1. Flower of Paradise Lost (4)\n2. Gilded Dreams (4)\n3. +80 EM set (2) / +80 EM set (2)*\n4. Thundering Fury (4)*",
        "1. Emblem of Severed Fate (4)\n2. Noblesse Oblige (2) / Thundering Fury (2) / +18% ATK set (2) / Emblem of Severed Fate (2) [Choose Two]\n3. Tenacity of the Millelith (4)*"
    ],
    "main_stats": [
        "Sands - Elemental Mastery\nGoblet - Elemental Mastery\nCirclet - Elemental Mastery\n",
        "Sands - Energy Recharge / ATK%*\nGoblet - Electro DMG / ATK%*\nCirclet - Crit Rate / DMG "
    ],
    "sub_stats": [
        "1. Elemental Mastery*\n2. ATK%\n3. Energy Recharge\n4. Crit Rate/ DMG\n\n*EM is essentially your only priority",
        "1. Crit Rate / DMG\n2. ATK%\n3. Energy Recharge\n4. Elemental Mastery\n5. Flat ATK"
    ],
    "talents": [
        "1. Skill\n2. Burst",
        "1. Burst \n2. Skill"
    ],
    "tips": [
        "You are aiming for between 850-1000+ Elemental mastery depending on weapon/artifact choice.",
        "Start your rotation with Raiden's Elemental Skill to amplify your party member's Elemental Burst damage.\n\nBurst combo :\n- Skill > Burst > 3NA + CA (3 times) > 1NA + CA (Recommended)\n- Skill > Burst > 3NA + CA (3 times) > 4NA (Optimal)\n\n*NA = Normal Attack, CA = Charged Attack\n\nThe recommended combo can be performed consistently even without attack speed buffs, the optimal combo while a tad stronger is also significantly more difficult to perform."
    ],
    "notes": "HYPERBLOOM\nIn this build Raiden is used as a Hyperbloom trigger unit in a Dendro team. She is one of the best units in the game for this role. Bringing greater energy particle generation, a faster rate of seed triggering and a team ult buff in exchange for reduced team flexibility compared to another top Hyperbloom triggering unit like Kuki.\n\nRegarding Artifact Choices:\n+80 EM set (2) / +80 EM set (2): In a team with one other Electro unit it's only 1 substat roll behind Gilded Dreams (4) (3-4 substat rolls behind in a team with no other Electro units) therefore you can usually just use the set with the most Elemental Mastery substat rolls on it.\nThundering Fury (4): Only really a consideration if you have a completed set of it already, with a higher number of Elemental Mastery substat rolls, or as a placeholder set while you farm other sets.\n\nDPS\nRaiden's Elemental Burst damage depends on her team's energy consumption prior to her Burst, and her Burst restores a comfortable amount of energy for her team (which is further amplified by her passive). This is especially convenient on teams that doesn't conflict with her element and wants the energy provision. (i.e. Eula, Electro, National teams, etc.).\n\nRegarding Weapon Choices: This list assumes the average across a variety of buffs. \nStaff of the Scarlet Sands: It is not recommended to build EM for this weapon as her other offensive stats still outclass it.\nSkyward Spine: Assumes that you are utilizing the ATK SPD buff to access higher damage combos. \nWavebreaker's Fin: At [R5], this weapon is relatively equal to Staff of Homa, depending on your total team burst cost.\nLithic Spear: The ranking for this weapon assumes 1 stack on its passive.\n\nRegarding Artifact Sets:\nTenacity of the Millelith (4): This set acts as a low investment support oriented set. Raiden is an excellent Tenacity of the Millelith (4) holder since her Elemental Skill has 100% uptime and procs very easily. Do note that if your Raiden is equipping this set, then she will sacrifice her personal damage.\n\nRegarding Main Stats Priority: \nRaiden's main stat priority for Sands and Goblet entirely depends on the substats, whether she has external buffs, and which weapon she is running. Using a optimizer/calculator would be the best way to work out your optimal setup."
}