{
    "name": "Sangonomiya Kokomi",
    "element": "HYDRO",
    "rarity": 5,
    "weapon_type": "CATALYST",
    "roles": [
        "SUPPORT\n✩",
        "DPS",
        "BLOOM DPS"
    ],
    "weapons": [
        "1. Thrilling Tales of Dragon Slayers (3✩)\n2. Prototype Amber (4✩)\n3. Hakushin Ring (4✩)*\n4. Sacrificial Fragments (4✩)*",
        "1. Everlasting Moonglow (5✩)\n2. Prototype Amber (4✩)\n3. Hakushin Ring (4✩)*\n4. Thrilling Tales of Dragon Slayers (3✩)*",
        "1. A Thousand Floating Dreams (5✩)\n2. Sacrificial Fragments (4✩)\n3. Magic Guide (3✩)\n~= Fruit of Fulfillment (4✩)"
    ],
    "artifacts": [
        "1. Tenacity of the Millelith (4)*\n2. Ocean-Hued Clam (4)*\n3. Maiden Beloved (4)\n4. Maiden Beloved (2) / Ocean-Hued Clam (2) / Tenacity of the Millelith (2) [Choose Two]",
        "1. Ocean-Hued Clam (4)\n2. Heart of Depth (4)\n3. Maiden Beloved (2) / Ocean-Hued Clam (2) / Heart of Depth (2) / Tenacity of the Millelith (2) [Choose Two]\n4. Tenacity of the Millelith (4)*",
        "1. Flower of Paradise Lost (4)\n2. Gilded Dreams (4)\n3. +80 EM set (2) +80 EM set (2)\n4. Ocean-Hued Clam (4)*"
    ],
    "main_stats": [
        "Sands - Energy Recharge / HP%\nGoblet - HP%\nCirclet - Healing Bonus / HP%\n\n**Mainstats are not important for Tenacity of the Millelith (4) if you do not need the extra healing. Focus on Energy Recharge substats instead.",
        "Sands - HP% / Energy Recharge\r\nGoblet - Hydro DMG\r\nCirclet - Healing Bonus",
        "Sands - Elemental Mastery\nGoblet - Elemental Mastery\nCirclet - Elemental Mastery"
    ],
    "sub_stats": [
        "1. Energy Recharge\n2. HP%\n3. ATK%\n4. Flat HP\n5. Flat ATK\n\n",
        "1. HP%\n2. Energy Recharge\n3. ATK%\n~= Flat HP\n4. Elemental Mastery\n5. Flat ATK",
        "1. Elemental Mastery\n2. Energy Recharge\n3. HP%\n4. Flat HP"
    ],
    "talents": [
        "1. Skill\n2. Burst",
        "1. Burst\n2. Normal Attack\n3. Skill",
        "1. Skill\n2. Burst"
    ],
    "tips": [
        "Kokomi's Elemental Burst dynamically alters her skill's damage, this means that you cannot use her Burst to snapshot the buff onto the Skill and swap out.\n",
        "Due to Kokomi's high stamina cost on her Charged Attacks, her best attack strings are: \n\nAt [C0]: N2D \nAt [C1]: N3D*\n\n*N3D might result in a loss of Beidou Stormbreaker hits (DPS loss), and as such is only recommended in a Vaporize comp where the added Hydro application is favoured.\n\n*NA = Normal Attack, D = Dash\n",
        NaN
    ],
    "notes": "SUPPORT\nSupport Kokomi focuses on just using her Elemental Burst before her Elemental Skill's duration ends to refresh her skill duration. This allows 100% uptime on Hydro application from her Elemental Skill for Freeze / Electro-charge teams.\n\nRegarding Weapon Choices:\nHakushin Ring: This weapon can provide Elemental DMG% for the team in Electro-charged teams and will outperform Prototype Amber if you value damage more than healing.\nSacrificial Fragments: Can be useful as Kokomi won't need to use her Elemental Burst to reset her skill duration. This allows for smoother rotations as she will not face the problem of missing out on the reset for her Elemental Skill due to not casting Burst in time.\n\nRegarding Artifact Sets:\nTenacity of the Millelith (4): With proper extension of Kokomi's Elemental Skill, she can maintain near 100% uptime on this artifact set's 4 piece effect.\nOcean Hued Clam (4): This ranking assumes Kokomi is being used only for her Elemental Skill. If she is being used to attack onfield during Elemental Burst, this set may overtake Tenacity of the Millelith (4). \n\nRegarding Main Stats and Sub Stats: \nEnergy Recharge: Prioritise Energy Recharge first to ensure you can always use Elemental Burst before the Elemental Skill expires in order to maintain Hydro application. \n\nDPS\nDPS Kokomi aims to maximise her onfield damage during her Elemental Burst's duration. Outside of her Elemental Burst, her damage is lackluster and not worth building for.\n\nRegarding Weapon Choices:\nThrilling Tales of Dragon Slayers: Although this weapon doesn't provide as much personal damage for Kokomi, the 48% ATK buff is usually more worth in most cases. This can be her best weapon in for overall team DPS if you don't already have another Thrilling Tales of Dragon Slayers user in your team.\nHakushin Ring: This weapon can provide Elemental DMG% for the team in Electro-charged teams, and is the best choice in those situations.\n\nRegarding Artifact Sets:\nTenacity of the Millelith (4): Although this set offers the lowest personal damage for Kokomi, the 20% ATK team buff can sometimes be better for overall team DPS.\n\nBLOOM DPS\nThis build is specifically for Bloom teams where Kokomi is the character intended to trigger the majority of Blooms.\n\nRegarding Aritfact Sets:\nOcean-Hued Clam (4): This set can do more damage than other options in certain situations, while also increasing Kokomi's healing to deal with Bloom self-damage. However, this set is very resin inefficient and is thus not recommended to farm specifically for this set."
}