{
    "name": "Xingqiu",
    "element": "HYDRO",
    "rarity": 4,
    "weapon_type": "SWORD",
    "roles": [
        "LOW ENERGY REQUIREMENTS\n(OFF-FIELD DPS) ✩",
        "HIGH ENERGY REQUIREMENTS\n(OFF-FIELD DPS)"
    ],
    "weapons": [
        "1. Primordial Jade Cutter (5✩)\n2. Mistsplitter Reforged (5✩)\n3. Haran Geppaku Futsu (5✩) \n4. Light of Foliar Incision (5✩) \n5. Skyward Blade (5✩)\n6. Summit Shaper (5✩)\n7. Favonius Sword (4✩)\n8. Festering Desire (4✩)*\n~=  Sacrificial Sword [R3+] (4✩)*\n~= Amenoma Kageuchi (4✩) \n~= Kagotsurube Isshin (4✩)\n~= Harbinger of Dawn [R5] (3✩)*\n9. Sapwood Blade (4✩)*\n10. Sacrificial Sword [R1-R2] (4✩)*\n\n",
        "1. Primordial Jade Cutter (5✩)\n2. Favonius Sword (4✩)\n3. Mistsplitter Reforged (5✩)\n4. Haran Geppaku Futsu (5✩)\n5. Skyward Blade (5✩)\n~= Light of Foliar Incision (5✩) \r\n~= Summit Shaper (5✩) \n~= Sacrificial Sword [R3+] (4✩)* \n7. Amenoma Kageuchi (4✩)\n8. Festering Desire [R5] (4✩)\n~= Kagotsurube Isshin (4✩)\n~= Sapwood Blade (4✩)*\n~= Sacrificial Sword [R1-R2] (4✩)"
    ],
    "artifacts": [
        "1. Emblem of Severed Fate (4)*\n2. Noblesse Oblige (4)*\n3. Nymph's Dream (4)\n~= Noblesse Oblige (2) / 15% Hydro DMG Bonus set (2) / +18% ATK set (2) / Emblem of Severed Fate (2) [Choose Two]\n4. Blizzard Strayer (4)*",
        NaN
    ],
    "main_stats": [
        "Sands - Energy Recharge / ATK%*\nGoblet - Hydro DMG\nCirclet - Crit Rate / DMG",
        NaN
    ],
    "sub_stats": [
        "1. Crit Rate / DMG\n2. ATK%\n3. Energy Recharge\n4. Elemental Mastery\n5. Flat ATK\n\n**Prioritize Energy Recharge first if you can't burst off cooldown",
        NaN
    ],
    "talents": [
        "1. Burst\n2. Skill\n",
        NaN
    ],
    "tips": [
        "Activating XQ's Elemental Skill or Elemental Burst applies Hydro to the on-field character with his shield. (Pyro in specific)\n\nCleansing Electro may take an additional switch for your character with the rain swords active, while Cryo would freeze you in place. \n\nIt is typicially recommended to use Xingqiu's Elemental Skill before his Burst. However, if Xingqiu is Constellation four, you may choose to use his Elemental Skill after his Burst for the increased damage. This increases his Energy Recharge needs so it is not recommended to use unless you run Sacrificial Sword or use the book trick method which involves pausing the game by opening a menu for a second to allow him to collect the particles.",
        NaN
    ],
    "notes": "OFF-FIELD DPS\nHigh and Low Energy Recharge Requirements depends on the amount of Energy Recharge your Xingqiu needs. Choose wisely based on the team he's in and how easily you can achieve Energy Recharge targets. Other Hydro characters and Energy Recharge based teammates like Raiden Shogun can help alleviate his energy requirements, as does his Constellation 6.\n\nRegarding Weapon Choices:\nThe weapon rankings assume you are running enough Energy Recharge to get Xingqiu's burst up off cooldown. If you are not, select an Energy Recharge weapon from this list.\nSacrificial Sword [R3+]: This weapon is extremely inconsistent and extends rotation lengths leading to an overall loss in DPS. This weapon does become more useful if Xingqiu is not the only hydro character on the team.\nHarbinger of Dawn [R5]: At [C6], if you can consistently keep the passive active, this has the potential to rival Sacrificial Sword [R3+]\nSapwood Blade: This weapon can be especially useful as a support weapon in Dendro based teams.\n\nBig thanks to Quincy#6965 for helping us with the weapon calculations.\n\nRegarding Artifact Sets:\nEmblem of Severed Fate (4): This set falls off in terms of damage if Xingqiu has less than 130% Energy Recharge.\nNoblesse Oblige (4): Offers party-wide ATK boost, you can use this set on Xingqiu if nobody else on the party is able to use it better. If someone else on the team already has Noblesse Oblige (4), Noblesse Oblige (4) should not be used.\nBlizzard Strayer (4): This set is only recommended on a freeze team to optimize Xingqiu's stats since he can mildly disregard Crit Rate and build Crit Damage instead for more damage output. Despite it outperforming Emblem of Severed Fate (4) within this niche, it is generally not recommended to specifically farm for this set.\n\nRegarding Main Stats Priority:\nIdeally you would be running ATK% Sands when your ER needs are fulfilled. ER needs can be found in the Xingqiu Mastersheet."
}